#+title: Morphological Analyzer for Japanese | 01 Dictionary Tree
#+date: 2024-01-25
#+layout: post
#+math: true
#+options: _:nil ^:nil
#+categories: learning
* 词典的准备
:PROPERTIES:
:header-args:shell: :dir ../_img/lisp/jp-word-segmentation/ :results silent
:END:
在自然语言处理入门一书中, 提供了中文的词典用于使用,
但是我的目标是用来做日语分词的, 所以得找一些日语词典.
这里考虑的是使用 [[http://www.edrdg.org/jmdict/edict.html][EDICT Dictionary File]] 来作为简单的日语词典,
并且仅使用其词条信息, 并不考虑其他的各种信息.

#+begin_html
<details><summary>获取和处理方法</summary>
#+end_html

从网页上下载 =edict.gz= 文件包并解压可以得到一个 =EUC-JP= 编码的文件,
将其使用 =iconv= ([[https://en.wikipedia.org/wiki/Iconv][iconv (Wikipedia)]], 对于 macOS 可以通过 homebrew 安装)
转换为 UTF-8 的编码:

下载词典 (去网站上直接下载也不是不行):

#+begin_src shell
  wget http://ftp.edrdg.org/pub/Nihongo/edict.gz
#+end_src

解压 =.gz= 文件:

#+begin_src shell
  gunzip edict.gz
#+end_src

然后转换文字编码:

#+begin_src shell
  iconv -f EUC-JP -t UTF-8 edict > edict-utf8
#+end_src

你可以用 =head edict-utf8= 命令来预览部分的词典.

#+begin_src shell :results replace :results verbatim :exports both
  tail edict-utf8 # head is also ok
#+end_src

#+RESULTS:
#+begin_example
凜々しい [りりしい] /(adj-i) gallant/manly/brave/imposing/awe-inspiring/chivalrous/dignified/
凜乎 [りんこ] /(adj-t,adv-to) commanding/awe-inspiring/
凜然 [りんぜん] /(adj-t,adv-to) (1) commanding/awe-inspiring/(adj-t,adv-to) (2) bitter (cold)/piercing/
凜烈 [りんれつ] /(adj-na,adj-t,adv-to) (form) biting (cold)/severe/intense/piercing/
凜冽 [りんれつ] /(adj-na,adj-t,adv-to) (form) biting (cold)/severe/intense/piercing/
凜凜 [りんりん] /(adj-t,adv-to) (1) severe/intense/awe-inspiring/commanding/(adj-t,adv-to) (2) biting/bitter (cold)/piercing/frigid/
凜凜しい [りりしい] /(adj-i) gallant/manly/brave/imposing/awe-inspiring/chivalrous/dignified/
熙々 [きき] /(adj-t,adv-to) (1) (rare) relaxed and enjoyable/(adj-t,adv-to) (2) (rare) spacious/vast/(adj-t,adv-to) (3) (rare) heavily trafficked/bustling/busy/
熙春茶 [ひちゅんちゃ] /(n) hyson (Chinese green tea)/
熙熙 [きき] /(adj-t,adv-to) (1) (rare) relaxed and enjoyable/(adj-t,adv-to) (2) (rare) spacious/vast/(adj-t,adv-to) (3) (rare) heavily trafficked/bustling/busy/
#+end_example

可以看到里面的数据大概如下:

#+begin_example
  词条 [读音] /(词性) 定义.../
#+end_example

用 Lisp 把它提取出来:

#+headers: :var file=(expand-file-name "../_img/lisp/jp-word-segmentation/edict-utf8")
#+headers: :results silent
#+begin_src lisp
  (defparameter *dictionary*
    (with-open-file (stream file)
      (let ((scaner (ppcre:create-scanner "[^ ]+")))
        (loop for line = (read-line stream nil)
              while line
              collect (ppcre:scan-to-strings scaner line))))
    "EDict Dictionary for Japanese word.")
#+end_src

#+begin_html
</details>
#+end_html

在之后会考虑使用其他的日语词典来进行替换. 

** 完全切分
朴素的切分方法如下:

#+begin_src lisp
  (defun simple-full-segment (text &optional (dic *dictionary*))
    "对 `text' 使用简单的匹配进行完全切分."
    (let ((word-list nil))
      (loop for i below (length text) do
        (loop for j from (1+ i) upto (length text)
              for word = (subseq text i j)
              if (find word dic :test #'string=)
                do (push word word-list)))
      ;; output shall be in sequence
      (nreverse word-list)))
#+end_src

一个简单的效果如下:

#+begin_src lisp :exports results :results verbatim
  (simple-full-segment "大学で日本語を勉強します")
#+end_src

#+RESULTS:
: ("大" "大学" "学" "で" "日" "日本" "日本語" "本" "語" "を" "勉強" "強" "し" "しま" "ま" "ます" "す")

#+begin_html
<details><summary>显然易见的可以提升的部分</summary>
#+end_html

+ 这个历遍搜索的部分就看起来让人很想去修改
+ 然后字符串匹配的部分也很需要去修改, 用自动机的话估计可以快一些

#+begin_html
</details>
#+end_html

